{
  "ChangeLogRelease1": {
    "DateRelease": "28-01-2024 00:52:31",
    "changeLogAnons": "Новые функции и улучшения",
    "versionXIA": "1"
  },
  "ChangeLogRelease2": {
    "DateRelease": "29-01-2024 23:31:00",
    "changeLogAnons": "Дополнительные улучшения",
    "versionXIA": "2"
  },
  "ChangeLogRelease3": {
    "DateRelease": "02-02-2024 23:18:33",
    "changeLogAnons": "Обновлено: логотип приложения, иконка списка изменений, название приложения, икона минимального окна приложения, обновлена иконка ярлыка приложения, подсказки для пользователя. Исправлена ошибка: загрузка лишнего диалогового окна, неверное отображение списка изменений, удаление строк происходило по внутреннему значению, фукнция CopyDateTime.",
    "versionXIA": "3"
  },
  "ChangeLogRelease4": {
    "DateRelease": "02-02-2024 23:46:20",
    "changeLogAnons": "Улучшенная отцентровка иконок и кнопок.",
    "versionXIA": "4"
  },
  "ChangeLogRelease5": {
    "DateRelease": "03-02-2024 01:17:10",
    "changeLogAnons": "Фикс: провека наличия обновления;  постоянно включенной камеры.",
    "versionXIA": "5"
  },
  "ChangeLogRelease6": {
    "DateRelease": "04-02-2024 19:32:00",
    "changeLogAnons": "Фикс: спрятаны функции предназначенные для разработчика; завершение процесса программы, при включенной камере, доработка функции - Множество удалений;  оптимизация кода",
    "versionXIA": "6"
  },
  "ChangeLogRelease7": {
    "DateRelease": "06-02-2024 02:07:28",
    "changeLogAnons": "Оптимизация: освобождение активных ресурсов перед завершением процесса программы; Обновлены все инструкции; Оптимизирован интерфейс разделов и дополнительных окон; Доработка функции - Удалить выпустившихся и отчисленных студентов; Добавлено бэк-функционала: проверка введенных значений(кол-во, числовое сравнение), маска ввода даты.",
    "versionXIA": "7"
  },
  "ChangeLogRelease8": {
    "DateRelease": "06-02-2024 21:10:36",
    "changeLogAnons": "Баги: изменено сообщение обновления; добавлена сверка длина ввода значений в поля; удаление отзывов доработано; проверка, если студент уже брал книгу, но его не существует - выводить сообщение; функция (отображать прогресс скачивания) – исправлена.",
    "versionXIA": "8"
  }
}